calm water resistance/KVLCC2/Fr0.1010/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-11.110970633490895 0 -7.217756513881881)
	(16.66645595023634 0 -7.217756513881881)
	(16.66645595023634 8.092636091322108 -7.217756513881881)
	(-11.110970633490895 8.092636091322108 -7.217756513881881)
	(-11.110970633490895 0 2.843358626680741)
	(16.66645595023634 0 2.843358626680741)
	(16.66645595023634 8.092636091322108 2.843358626680741)
	(-11.110970633490895 8.092636091322108 2.843358626680741)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (127 37 46) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
		);
	}
	sides
	{
		type patch;
		faces
		(
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

